# Pandas's Series

In [16]:
!pip install pandas==2.2.3
!pip install numpy==2.2.5

Requirement already satisfied: pandas==2.2.3 in /home/soul/anaconda3/envs/my_conda/lib/python3.12/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in /home/soul/anaconda3/envs/my_conda/lib/python3.12/site-packages (from pandas==2.2.3) (2.2.5)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/soul/anaconda3/envs/my_conda/lib/python3.12/site-packages (from pandas==2.2.3) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /home/soul/anaconda3/envs/my_conda/lib/python3.12/site-packages (from pandas==2.2.3) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /home/soul/anaconda3/envs/my_conda/lib/python3.12/site-packages (from pandas==2.2.3) (2025.2)
Requirement already satisfied: six>=1.5 in /home/soul/anaconda3/envs/my_conda/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas==2.2.3) (1.17.0)
Requirement already satisfied: numpy==2.2.5 in /home/soul/anaconda3/envs/my_conda/lib/python3.12/site-packages (2.2.5)

In [17]:
import numpy as np 
import pandas as pd

In [21]:
labels = ['a','b','c']
my_data= [10,20,30]
arr = np.array(my_data)
d = {'a': 10, 'b': 20, 'c':30}

In [22]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [23]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [25]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [26]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [27]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [28]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [29]:
pd.Series(data=[sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [30]:
ser1 = pd.Series([1,2,3,4], ['USA', 'Germany', 'USSR', 'Japan'])

In [31]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [32]:
ser2= pd.Series([1,2,5,4], ['USA','Germany','Italy','Japan'])

In [33]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [34]:
ser1['USA']

np.int64(1)

In [35]:
ser3=pd.Series(data=labels)

In [36]:
ser3

0    a
1    b
2    c
dtype: object

In [37]:
ser3[2]

'c'

In [38]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# Pandas DataFrames - Part 1

In [39]:
import numpy as np 
import pandas as pd

In [41]:
from numpy.random import randn

In [42]:
np.random.seed(101)

In [43]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [44]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [46]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [47]:
type(df['W'])

pandas.core.series.Series

In [48]:
type(df)

pandas.core.frame.DataFrame

In [49]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [50]:
df['X']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [51]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [52]:
df['new']

KeyError: 'new'

In [53]:
df['new'] = df['W']+df['Y']

In [54]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [55]:
df.drop('new')

KeyError: "['new'] not found in axis"

In [56]:
df.drop('new', axis=1)  # Axis 0 means row, and 1 means column

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [58]:
df.drop('new', axis=1, inplace=True) # Parmenently delete new column

In [59]:
df.drop('E', axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [60]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [62]:
df.shape # axis-0=5 and axis-1=4

(5, 4)

In [63]:
df['Y']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [75]:
df[['Z','X']]

          Z         X
A  0.503826  0.628133
B  0.605965 -0.319318
C -0.589001  0.740122
D  0.955057 -0.758872
E  0.683509  1.978757

In [80]:
df[['Z','X']]

          Z         X
A  0.503826  0.628133
B  0.605965 -0.319318
C -0.589001  0.740122
D  0.955057 -0.758872
E  0.683509  1.978757

In [65]:
#Rows

In [66]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [67]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [68]:
df.loc['D']

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [70]:
df.iloc[3] #index position of rows

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [72]:
df.loc['B','Y'] # Single data grap by row and column name

np.float64(-0.8480769834036315)

In [73]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [74]:
df.loc[['A','C']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001

# Pandas's DataFrames - Part 2

In [81]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [82]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [83]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [84]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [85]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [86]:
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [87]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [88]:
resultdf = df[df['W']>0]

In [89]:
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [90]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [91]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [92]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [93]:
boolser = df['W']>0
result = df[boolser]
mycols = ['Y','X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [94]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [95]:
df[(df['W']>0) and (df['Y']>1)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [96]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [97]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [98]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [101]:
df.reset_index() # For permanent, use inplace = True

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [100]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [102]:
newind= 'CA NY WY OR CO'.split()

In [103]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [105]:
df['States'] = newind

In [106]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [108]:
df.set_index('States') # For permanent use inplace=True

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

# Pandas's DataFrame Part-3

In [10]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [11]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [12]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [13]:
inside

[1, 2, 3, 1, 2, 3]

In [14]:
list(zip(outside, inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [15]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [16]:
df = pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])

In [17]:
df

             A         B
G1 1 -1.454524 -0.537277
   2  1.444722 -0.821102
   3 -1.022366  0.599502
G2 1 -0.319633 -1.087859
   2  0.624875  0.004178
   3 -0.632950 -0.174949

In [18]:
df.loc['G1']

          A         B
1 -1.454524 -0.537277
2  1.444722 -0.821102
3 -1.022366  0.599502

In [19]:
df.loc['G1'].loc[1]

A   -1.454524
B   -0.537277
Name: 1, dtype: float64

In [21]:
df.loc['G1'].loc[1]['A']

np.float64(-1.4545236312026202)

In [23]:
df.index.names

FrozenList([None, None])

In [24]:
df.index.names=['Groups', 'Num']

In [25]:
df

                   A         B
Groups Num
G1     1   -1.454524 -0.537277
       2    1.444722 -0.821102
       3   -1.022366  0.599502
G2     1   -0.319633 -1.087859
       2    0.624875  0.004178
       3   -0.632950 -0.174949

In [26]:
df.loc['G2']

            A         B
Num
1   -0.319633 -1.087859
2    0.624875  0.004178
3   -0.632950 -0.174949

In [27]:
df.loc['G2'].loc[2]

A    0.624875
B    0.004178
Name: 2, dtype: float64

In [28]:
df.loc['G2'].loc[2]['B']

np.float64(0.004177793334843148)

In [29]:
df

                   A         B
Groups Num
G1     1   -1.454524 -0.537277
       2    1.444722 -0.821102
       3   -1.022366  0.599502
G2     1   -0.319633 -1.087859
       2    0.624875  0.004178
       3   -0.632950 -0.174949

In [30]:
df.xs('G1')

            A         B
Num
1   -1.454524 -0.537277
2    1.444722 -0.821102
3   -1.022366  0.599502

In [32]:
df.xs(1, level='Num')

               A         B
Groups
G1     -1.454524 -0.537277
G2     -0.319633 -1.087859

# Missing Data

In [33]:
import numpy as np
import pandas as pd

In [34]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan, np.nan], 'C':[1,2,3]}

In [35]:
df = pd.DataFrame(d)

In [36]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [37]:
df.dropna() # by default it will drop nan columns

     A    B  C
0  1.0  5.0  1

In [40]:
df.dropna(axis=1) # axis 0 for columns and axis 1 for rows

   C
0  1
1  2
2  3

In [41]:
df.dropna(axis=0, thresh=2) # Row two has allast 2 non-nan value

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [43]:
df.dropna(axis=0, thresh=3)

     A    B  C
0  1.0  5.0  1

In [45]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [46]:
df.fillna(value='Fill Value')

            A           B  C
0         1.0         5.0  1
1         2.0  Fill Value  2
2  Fill Value  Fill Value  3

In [47]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [48]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [49]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

# Groupby

In [3]:
import numpy as np
import pandas as pd

In [4]:
data = {'Company':['GOOG','GOOG','MSFT', 'MSFT', 'FB', 'FB'],
       'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
        'Sales': [200, 120, 340, 124,243, 350]
       }

In [5]:
df = pd.DataFrame((data))

In [6]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [7]:
df.groupby('Company')

In [8]:
byComp = df.groupby('Company')

In [11]:
byComp.mean(numeric_only=True)  # Error

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [12]:
byComp.sum(numeric_only=True) # Error

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [13]:
byComp.std(numeric_only=True)

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [14]:
byComp.sum(numeric_only=True).loc['FB']

Sales    593
Name: FB, dtype: int64

In [16]:
df.groupby('Company').sum(numeric_only=True).loc['FB']

Sales    593
Name: FB, dtype: int64

In [18]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [19]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [20]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [24]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [25]:
df.groupby('Company').describe().loc['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [22]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [23]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

# Merging, Joining and Concatenating

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({
    'A':['A0', 'A1', 'A2', 'A3'],
    'B':['B0', 'B1', 'B2', 'B3'],
    'C':['C0', 'C1', 'C2', 'C3'],
    'D':['D0', 'D1', 'D2', 'D3']},
    index=[0,1,2,3])

In [3]:
df2 = pd.DataFrame({
    'A':['A4', 'A5', 'A6', 'A7'],
    'B':['B4', 'B5', 'B6', 'B7'],
    'C':['C4', 'C5', 'C6', 'C7'],
    'D':['D4', 'D5', 'D6', 'D7']},
    index=[4,5,6,7])

In [4]:
df3 = pd.DataFrame({
    'A':['A8', 'A9', 'A10', 'A11'],
    'B':['B8', 'B9', 'B10', 'B11'],
    'C':['C8', 'C9', 'C10', 'C11'],
    'D':['D8', 'D9', 'D10', 'D11']},
    index=[8,9,10,11])

In [5]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [6]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [7]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [8]:
pd.concat([df1, df2, df3]) # Rowwise

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [9]:
pd.concat([df1, df2, df3], axis=1) # Columnwise

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [10]:
left = pd.DataFrame({
    'key':['K0','K1','K2','K3'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']
})

In [11]:
right = pd.DataFrame({
    'key':['K0','K1','K2','K3'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']
})

In [12]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [13]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [14]:
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [15]:
left = pd.DataFrame({
    'key1': ['K0', 'K0', 'K1', 'K2'],
    'key2':['K0', 'K1', 'K0', 'K1'],
    'A':['A0', 'A1', 'A2', 'A3'],
    'B':['B0', 'B1', 'B2', 'B3']
})

In [16]:
right = pd.DataFrame({
    'key1': ['K0', 'K1', 'K1', 'K2'],
    'key2':['K0', 'K0', 'K0', 'K0'],
    'C':['C0', 'C1', 'C2', 'C3'],
    'D':['D0', 'D1', 'D2', 'D3']
})

In [17]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [18]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K0  NaN  NaN   C3   D3
5   K2   K1   A3   B3  NaN  NaN

In [19]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [20]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [21]:
## Joining

In [23]:
left=pd.DataFrame({
    'A':['A0', 'A1', 'A2'],
    'B':['B0', 'B1', 'B2']},
    index=['K0', 'K1', 'K2'])

In [24]:
right=pd.DataFrame({
    'C':['C0', 'C1', 'C2'],
    'D':['D0', 'D1', 'D2']},
    index=['K0', 'K2', 'K3'])

In [25]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [26]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D1
K3  NaN  NaN   C2   D2

# Operations

In [27]:
import numpy as np
import pandas as pd

In [28]:
df = pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[444,555,666,444],
    'col3':['abc', 'def', 'ghi', 'xyz']
})

In [29]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [30]:
df['col2']

0    444
1    555
2    666
3    444
Name: col2, dtype: int64

In [32]:
df['col2'].unique()

array([444, 555, 666])

In [33]:
len(df['col2'].unique())

3

In [34]:
df['col2'].nunique()

3

In [35]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [36]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [37]:
df[df['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [38]:
df['col1'] > 2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [39]:
df[(df['col1'] > 2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [40]:
def times2(x):
    return x*2

In [41]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [44]:
df['col1'].sum()

np.int64(10)

In [46]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [47]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [48]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64